In [2]:
import pandas as pd
A=a_group.median()
B=b_group.max()

In [ ]:
ebola.fillna(0)

In [ ]:
ebola.fillna(method = 'ffill')

In [ ]:
ebola.fillna(method = 'bfill')

In [ ]:
(2769 + 2730) / 2

In [ ]:
ebola['Cases_Guinea'].astype(int)

In [ ]:
ebola.dropna(axis = 0)  # [0, 1, 2, 4, ]

In [ ]:
ebola.dropna(axis = 1)

In [ ]:
ebola_fill = ebola.fillna(method = 'bfill').fillna(0)

In [ ]:
ebola_fill.info()

### 누락값 처리 문제

In [4]:
df = pd.read_csv('../data/basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [ ]:
df.info()

#### 1번
* 첫번째 데이터 부터 순서대로 50:50으로 데이터를 나누고, 앞에서 부터 50%의 데이터(이하, A그룹)는 'f1'컬럼의 결측치를 A그룹의 중앙값으로 채우고, 뒤에서부터 50% 데이터(이하, B그룹)는 'f1'컬럼의 결측치를 B그룹의 최대값으로 채운 후, A그룹과 B그룹의 표준편차 합을 구하시오. (소수점 첫째자리)

In [5]:
# step1
# 순서대로 50:50으로 데이터를 나누고
# 앞에서 부터 50%의 데이터(이하, A그룹), 뒤에서부터 50% 데이터(이하, B그룹)\
A = df.iloc[:50]
B = df.iloc[50:]
print(A.shape, B.shape)

(50, 8) (50, 8)

In [6]:
# step2
# A그룹은 누락값을 A그룹의 중앙값 (f1컬럼 대상)
# B그룹은 누락값을 B그룹의 최대값 (f1컬럼 대상)
A_median = A['f1'].median()
B_max = B['f1'].max()

A_fill = A['f1'].fillna(A_median)
B_fill = B['f1'].fillna(B_max)
print(A_fill.count(), B_fill.count())

50 50

In [7]:
# step3
# A그룹과 B그룹의 표준편차 합 (소수점 첫째자리)
std_sum = A_fill.std() + B_fill.std()
round(std_sum, 1)

42.0

#### 2번
* 'f4'컬럼 기준 내림차순 정렬과 'f5'컬럼 기준 오름차순 정렬을 순서대로 다중 조건 정렬하고나서 앞에서부터 10개의 데이터 중 'f5'컬럼의 최소값을 찾고, 이 최소값으로 앞에서 부터 10개의 'f5'컬럼 데이터를 변경함. 그리고 'f5'컬럼의 평균값을 계산함. (단 소수점 둘째자리까지 출력(셋째자리에서 반올림))

In [15]:
# 'f4'컬럼 기준 내림차순 정렬과 'f5'컬럼 기준 오름차순 정렬
sorted_df = df.sort_values(['f4', 'f5'], ascending=[False, True])
sorted_df.head(10)

      id   age city    f1  f2   f3    f4         f5
42  id43  23.0   대구  60.0   0  NaN  ISTP  29.269869
69  id70  -9.0   경기  96.0   1  NaN  ISTP  48.431184
16  id17  74.0   서울   NaN   1  NaN  ISTP  67.886373
22  id23  34.0   부산  75.0   1  NaN  ISTP  69.730313
2   id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
50  id51  36.0   대구   NaN   0  NaN  ISTJ  83.685380
65  id66  87.0   경기   NaN   1  NaN  ISFP  17.252986
20  id21  90.0   부산   NaN   1  NaN  ISFP  29.269869
70  id71  35.0   경기  84.0   2  NaN  ISFP  52.667078
67  id68  35.0   경기  45.0   2  NaN  ISFP  67.886373

In [ ]:
items = [1,2,3]
items2 = items.copy()
print(items)
print(items2)

items2.pop()
print(items2)
print(items)

In [13]:
# 앞에서부터 10개의 데이터 중 'f5'컬럼의 최소값 [1,2,3,4,5,6,7,8,9,10]
# 앞에서 부터 10개의 'f5'컬럼 데이터를 변경     [1,1,1,1,1,1,1,1,1,1]

min_value = sorted_df.iloc[:10, -1].min()

# df를 복사하는 방법
sorted_df2 = sorted_df.copy()

sorted_df2.iloc[:10, -1] = min_value
sorted_df2

      id   age city    f1  f2   f3    f4         f5
42  id43  23.0   대구  60.0   0  NaN  ISTP  17.252986
69  id70  -9.0   경기  96.0   1  NaN  ISTP  17.252986
16  id17  74.0   서울   NaN   1  NaN  ISTP  17.252986
22  id23  34.0   부산  75.0   1  NaN  ISTP  17.252986
2   id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
..   ...   ...  ...   ...  ..  ...   ...        ...
32  id33  47.0   부산  94.0   0  NaN  ENFJ  17.252986
40  id41  81.0   대구  55.0   0  NaN  ENFJ  37.113739
1   id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
53  id54  53.0   대구   NaN   1  NaN  ENFJ  69.730313
0   id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791

[100 rows x 8 columns]

In [14]:
min_value

17.25298557

In [12]:
# 'f5'컬럼의 평균값 (소수점 둘째)

round(sorted_df2['f5'].mean(), 2)

53.63

In [ ]:
def my_sq(x):
    return x ** 2 

def my_exp(x, n):
    return x ** n

In [ ]:
import pandas as pd

df = pd.DataFrame({'a': [10, 20, 30], 'b': [20, 30, 40]})
df

In [ ]:
sq = df['a'].apply(my_sq)
print(sq)

In [ ]:
df['a'] : Series  >>  10, 20, 30  >>   my_sq(10), my_sq(20), my_sq(30)  
>> 100, 400, 900  >> new Series

In [ ]:
df['a'].apply(my_exp, n=2)

In [ ]:
def plus10(x):
    return x + 10

lambda x : x + 10

In [ ]:
df['a'].apply(lambda x : x ** 2)

In [ ]:
df['a'].apply(lambda x, n : x ** n, n = 2)

In [ ]:
df = pd.read_csv('data/pandas/basic1.csv')
df.head()

In [ ]:
def mbti(x):
    return x[0]

lambda x : x[0]

In [ ]:
df['mbti1'] =  df['f4'].apply(mbti)
df

In [ ]:
df = pd.DataFrame({'a': [10, 20, 30], 'b': [20, 30, 40]})
df

In [ ]:
def print_me(x):
    print(x)

In [ ]:
df.apply(print_me, axis = 1)

In [ ]:
print_me(df['a'])    # df['b']

In [ ]:
a = print()
print(a)

In [ ]:
exam = pd.read_csv('data/pandas/exam.csv')
exam.head()

In [ ]:
exam['math'].apply(lambda x : x // 10)

In [ ]:
exam['math']  //  10

In [ ]:
exam['total']  = exam['math'] + exam['english'] + exam['science']
exam

In [ ]:
# ebola
# pd.read_csv('country_timeseries.csv', parse_dates = ['Date'])
ebola['Date2'] = pd.to_datetime(ebola['Date'])
year = ebola['Date2'].dt.year
                    # '1/5/2015'
ebola['Date'].apply(lambda x : int(x[-4:])  )

# ebola[['Date', 'Date2']].head(3)

In [ ]:
titanic = pd.read_csv('data/pandas/titanic.csv')
titanic.head(3)

In [ ]:
titanic.info()

In [ ]:
def count_missing(vec):
    return vec.isnull().sum()

In [ ]:
titanic.apply(   count_missing   , axis = 1)

In [ ]:
def prop_missing(vec):
    # 누락값의 개수
    num = count_missing(vec)
    # 전체 로우(컬럼)의 개수
    length = vec.size
    return num / length

In [ ]:
titanic.apply(   prop_missing   , axis = 0)

In [ ]:
import numpy as np
# male or female or etc
def convert(x):
    if x == 'male':
        return 0
    elif x == 'female':
        return 1
    else:
        return np.nan

In [ ]:
titanic['Sex'] = titanic['Sex'].apply(convert)

In [ ]:
titanic

In [ ]:
avg_age = titanic['Age'].mean() # 177

In [ ]:
titanic['Age'].fillna(avg_age)

In [ ]:
titanic['Cabin'].unique()

In [ ]:
titanic['Cabin'].fillna('N').apply(lambda x : x[0])

In [ ]:
titanic['Cabin'].fillna('N').apply(lambda x : x[0]).unique()

In [ ]:
titanic[titanic['Embarked'].isnull()]

In [ ]:
titanic['Embarked'].value_counts()

In [ ]:
ebola